In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter
print(os.listdir("../input"))

FileNotFoundError: [WinError 3] Системе не удается найти указанный путь: '../input'

In [4]:
data = pd.read_csv(r"C:\Users\админ\Documents\data_new.csv")
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [5]:
len(data)

1890

# Предобработка датасета

In [9]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [18]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)
data[data.budget == data.budget.max()].original_title

491    the warrior's way
Name: original_title, dtype: object

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [19]:
answer_ls.append(2)
data[data.runtime == data.runtime.max()].original_title

1158    gods and generals
Name: original_title, dtype: object

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [20]:
answer_ls.append(3)
data[data.runtime == data.runtime.min()].original_title

769    winnie the pooh
Name: original_title, dtype: object

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [21]:
answer_ls.append(2)
data['runtime'].mean()

109.65343915343915

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [22]:
answer_ls.append(1)
s= data['runtime'].sort_values(ascending = False)
s.describe()

count    1890.000000
mean      109.653439
std        18.013641
min        63.000000
25%        97.000000
50%       106.500000
75%       120.000000
max       214.000000
Name: runtime, dtype: float64

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [23]:
answer_ls.append(5)
data['profit'] = data['revenue'] - data['budget']
data.sort_values(['profit'], ascending = False).head(5)
data[data.profit == data.profit.max()].original_title

239    avatar
Name: original_title, dtype: object

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [24]:
answer_ls.append(2)
data['profit'] = data['revenue'] - data['budget']
#data.sort_values(['profit'], ascending = False).head(5)
data[data.profit == data.profit.min()].original_title

491    the warrior's way
Name: original_title, dtype: object

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [25]:
answer_ls.append(1)
len(data[data.profit > 0])

1478

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [26]:
answer_ls.append(4)
profitable = data[data.release_year == 2008]
profitable.groupby(['original_title']).sum()['profit'].reset_index().sort_values(['profit'], ascending = False)

                                       original_title     profit
83                                    the dark knight  816921825
35  indiana jones and the kingdom of the crystal s...  601636033
44                                         mamma mia!  557841637
40                                      kung fu panda  501744560
28                                            hancock  474029371
..                                                ...        ...
72                                        speed racer  -26054234
85                                        the express  -30206504
14                                      city of ember  -37130952
56                                          outlander  -42966317
3                                           australia  -80445998

[121 rows x 2 columns]

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [27]:
answer_ls.append(5)
unprofitable = data[(data.release_year == 2012) | (data.release_year == 2013) | (data.release_year == 2014)]
unprofitable.groupby(['original_title']).sum()['profit'].reset_index().sort_values(['profit'], ascending = True)

                      original_title      profit
309                  the lone ranger  -165710090
210                         r.i.p.d.   -68351500
351                      upside down   -51893525
138  legends of oz: dorothy's return   -51337973
47                bullet to the head   -45510171
..                               ...         ...
62                   despicable me 2   894761885
238                          skyfall   908561013
121                       iron man 3  1015439994
91                            frozen  1124219009
260                     the avengers  1299557910

[367 rows x 2 columns]

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [46]:
answer_ls.append(4)
data.describe(include = ['object'])

,imdb_id,original_title,cast,director,tagline,overview,genres,production_companies,release_date
count,1890,1890,1890,1890,1890,1890,1890,1890,1890
unique,1890,1888,1879,958,1881,1890,653,1625,1435
top,tt0162983,the gift,Jennifer Lawrence|Josh Hutcherson|Liam Hemswor...,Steven Soderbergh,The only way out is down.,The special bond that develops between plus-si...,Comedy,New Line Cinema,12/25/2014
freq,1,2,3,13,2,1,141,21,7

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [29]:
answer_ls.append(2)
data[data.profit > 0].genres.value_counts(ascending = False)

Comedy                                       121
Drama                                         70
Comedy|Romance                                52
Drama|Romance                                 38
Horror|Thriller                               31
                                            ...
Horror|Adventure|Action                        1
Fantasy|Comedy|Romance|Science Fiction         1
Animation|Comedy|Family|Western|Adventure      1
Mystery|Adventure|Comedy                       1
Drama|Action|Thriller|Science Fiction          1
Name: genres, Length: 548, dtype: int64

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [30]:
answer_ls.append(3)
data.describe(include = ['object'])

,imdb_id,original_title,cast,director,tagline,overview,genres,production_companies,release_date
count,1890,1890,1890,1890,1890,1890,1890,1890,1890
unique,1890,1888,1879,958,1881,1890,653,1625,1435
top,tt0162983,the gift,Jennifer Lawrence|Josh Hutcherson|Liam Hemswor...,Steven Soderbergh,The only way out is down.,The special bond that develops between plus-si...,Comedy,New Line Cinema,12/25/2014
freq,1,2,3,13,2,1,141,21,7

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [31]:
answer_ls.append(4)
data[data.profit > 0]['director'].value_counts(ascending = False)

Ridley Scott               12
Steven Spielberg           10
Clint Eastwood             10
Steven Soderbergh          10
Shawn Levy                  9
                           ..
Hoyt Yeatman                1
Chris Nahon                 1
Juan Carlos Fresnadillo     1
Gareth Edwards              1
Robert Stromberg            1
Name: director, Length: 774, dtype: int64

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [32]:
answer_ls.append(5)
grouped_df = data.groupby(['director'])['profit'].sum().sort_values(ascending = False)
print(grouped_df)

director
Peter Jackson            5202593685
David Yates              3379295625
Christopher Nolan        3162548502
J.J. Abrams              2839169916
Michael Bay              2760938960
                            ...
David Bowers|Sam Fell     -84540684
Peter Hyams               -86956545
Ron Underwood             -92896027
James L. Brooks           -96289726
Sngmoo Lee               -413912431
Name: profit, Length: 958, dtype: int64

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [57]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [ ]:
answer_ls.append(1)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [ ]:
answer_ls.append(1)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [33]:
answer_ls.append(2)
import collections
from collections import Counter 
which_genre = Counter()
for x in data.loc[data['cast'].map(lambda x: True if 'Nicolas Cage' in x else False)]['genres'].str.split('|'):
    which_genre += Counter(x)
display(which_genre)

Counter({'Thriller': 15,
         'Action': 17,
         'Science Fiction': 4,
         'Adventure': 7,
         'Drama': 12,
         'Mystery': 3,
         'Crime': 10,
         'Animation': 3,
         'Family': 3,
         'Fantasy': 8,
         'Comedy': 6,
         'History': 2,
         'War': 1,
         'Horror': 1,
         'Romance': 1})

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [34]:
answer_ls.append(1)
company = pd.DataFrame(data['production_companies'].str.split('|').tolist()).stack().value_counts()
display(company)

Universal Pictures                        173
Warner Bros.                              168
Paramount Pictures                        122
Columbia Pictures                         117
Twentieth Century Fox Film Corporation    109
                                         ...
Unity Productions                           1
Reforma Films                               1
Disney                                      1
Corduroy Films                              1
Film Department, The                        1
Length: 1772, dtype: int64

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [56]:
answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [ ]:
answer_ls.append(1)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [ ]:
answer_ls.append(1)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [35]:
answer_ls.append(1)
paramount_lower = data[data.production_companies.str.contains('Paramount Pictures')]
paramount_lower.groupby(['original_title']).sum()['profit'].reset_index().sort_values(['profit'], ascending = True)

                                        original_title     profit
39                                k-19: the widowmaker  -64831034
101                                           timeline  -60519261
52                                                next  -51788987
2                                                alfie  -46604061
107                                            twisted  -24805000
..                                                 ...        ...
47                mission: impossible - ghost protocol  549713380
102                                       transformers  559709780
32   indiana jones and the kingdom of the crystal s...  601636033
105                transformers: revenge of the fallen  686297228
104                     transformers: dark of the moon  928746996

[122 rows x 2 columns]

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [36]:
answer_ls.append(5)
grouped_df = data.groupby(['release_year'])['profit'].sum().sort_values(ascending = False)
print(grouped_df)

release_year
2015    18668572378
2014    16397812953
2012    16077001687
2013    15243179791
2011    14730241341
2009    13423744372
2010    13117292530
2008    11663881990
2007    11565911801
2004     9634180720
2003     9228823312
2002     9002361487
2005     8981925558
2006     8691077320
2001     7950614865
2000     6101399805
Name: profit, dtype: int64

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [37]:
answer_ls.append(1)
warner_top = data[data.production_companies.str.contains('Warner Bros.')]
warner_top.groupby(['release_year']).sum()['profit'].reset_index().sort_values(['profit'], ascending = False)

    release_year      profit
14          2014  2295464519
7           2007  2201675217
8           2008  2134595031
10          2010  1974712985
11          2011  1871393682
3           2003  1855493377
9           2009  1822454136
13          2013  1636453400
4           2004  1631933725
5           2005  1551980298
1           2001  1343545668
12          2012  1258020056
2           2002  1022709901
15          2015   870368348
6           2006   620170743
0           2000   452631386

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [38]:
answer_ls.append(4)
s = data['month'].value_counts(ascending = False)
display(s)

9     227
12    191
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: month, dtype: int64

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [39]:
answer_ls.append(2)
import pandas as pd
pd.to_datetime(data.release_date)
data['month'] = pd.DatetimeIndex(data.release_date).month 
#display(data)
#del data['release_month'] 
s = data[(data.month == 6) | (data.month == 7)  | (data.month == 8)].imdb_id.value_counts(ascending = False)
display(len(s))

450

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [40]:
answer_ls.append(5)

pd.to_datetime(data.release_date)
data['month'] = pd.DatetimeIndex(data.release_date).month 
#display(data)
s = data[(data.month == 12) | (data.month == 1)  | (data.month == 2)].director.value_counts(ascending = False)
display(s)

Peter Jackson           7
Clint Eastwood          6
Steven Soderbergh       6
Nancy Meyers            4
Adam Shankman           4
                       ..
Chris Noonan            1
Dean Parisot            1
Jon Turteltaub          1
Nicolas Winding Refn    1
Doug Liman              1
Name: director, Length: 333, dtype: int64

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [41]:
answer_ls.append(2)
pd.to_datetime(data.release_date)
data['month'] = pd.DatetimeIndex(data.release_date).month 
prof_of_month = data.groupby(['month'])['profit'].sum().sort_values(ascending = False)
display(prof_of_month)

month
6     27551262500
12    26563071474
5     25039516141
11    18654155473
7     18307895020
3     13720216540
10    12994907859
4     12876005537
9     10878921041
8      9640610446
2      8854574425
1      5396885454
Name: profit, dtype: int64

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [55]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [54]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [48]:
answer_ls.append(3)
import unicodedata
list_word = []
data.original_title = data.original_title.str.lower()
for i in data['original_title']:
    list_word.extend(i.split())
unique_words = pd.Series(list_word).unique()
display(len(unique_words))

2461

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [49]:
answer_ls.append(1)
data[(data.vote_average> 7.8)].original_title

9                                          Inside Out
34                                               Room
118                                      Interstellar
119                           Guardians of the Galaxy
125                                The Imitation Game
128                                         Gone Girl
138                          The Grand Budapest Hotel
370                                         Inception
600                                   The Dark Knight
873                                       The Pianist
1082    The Lord of the Rings: The Return of the King
1184                          The Wolf of Wall Street
1192                                 12 Years a Slave
1801                                          Memento
Name: original_title, dtype: object

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [ ]:
answer_ls.append(1)

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [53]:
answer_ls.append(4)
data[data.revenue > data.budget].director.value_counts(ascending = False)
data['director'].value_counts(ascending = False)
data[(data.director == 'Christopher Nolan') &  (data.revenue > data.budget)].director.value_counts(ascending = False)
data[data.director == 'Christopher Nolan'].director.value_counts(ascending = False)

Ridley Scott               12
Steven Spielberg           10
Clint Eastwood             10
Steven Soderbergh          10
Shawn Levy                  9
                           ..
Hoyt Yeatman                1
Chris Nahon                 1
Juan Carlos Fresnadillo     1
Gareth Edwards              1
Robert Stromberg            1
Name: director, Length: 774, dtype: int64

# Submission

In [58]:
len(answer_ls)

37

In [59]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       5
1    2       5
2    3       2
3    4       3
4    5       4
5    6       2
6    7       3
7    8       2
8    9       1
9   10       5
10  11       2
11  12       1
12  13       4
13  14       5
14  15       2
15  16       3
16  17       4
17  18       5
18  19       2
19  20       1
20  21       1
21  22       5
22  23       1
23  24       4
24  25       2
25  26       5
26  27       2
27  28       3
28  29       4
29  30       3
30  31       4
31  32       4
32  33       4
33  34       5
34  35       5
35  36       4
36  37       1

In [ ]:
#https://github.com/nailyatergemes/project1.git